app/Models/ArticleModel.php

SELECT *
FROM `articles`
ORDER BY `date_publication` DESC
 LIMIT 10
---
    public function getRecentArticles($limit = 5)
    {
        return $this->orderBy('date_publication', 'DESC')
                    ->limit($limit)
                    ->get()
                    ->getResultArray();

SELECT *
FROM `articles`
WHERE `id` = '1'
AND `slug` = 'guerre-en-iran'
 LIMIT 1
---
    public function getArticleBySlugAndId($id, $slug)
    {
        return $this->where(['id' => $id, 'slug' => $slug])
                    ->first();